Nome: Gabriel Pinto Drubi
Matricula: 2211328
Turma: 33A

In [1]:
import pandas as pd
import numpy as np
from google.colab import drive
from random import random

1- Salve a base de dados escolhida no seu drive e importe para um notebook do Colab, criando um Dataframe

In [2]:
drive.mount("/drive")
titanic = pd.read_csv("/drive/MyDrive/titanic/class_titanic.csv")

Mounted at /drive

2- Inspecione as colunas do conjunto de dados (Nome das colunas e tipo de dados)

In [18]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 378 entries, 2 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  378 non-null    int64
 1   Pclass       378 non-null    int64
 2   Name         378 non-null    object
 3   Sex          378 non-null    object
 4   Age          201 non-null    float64
 5   SibSp        378 non-null    int64
 6   Parch        378 non-null    int64
 7   Ticket       378 non-null    object
 8   Fare         378 non-null    float64
 9   Cabin        55 non-null     object
 10  Embarked     378 non-null    object
 11  Survived     378 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 46.5+ KB

3- Escolha uma coluna com valores numéricos e apague todas as linhas que possuam valor nulo (OBS: nenhuma colonua tem valores nulos)

In [3]:
titanic["Age"].dropna(axis=0, inplace=True)
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

4- Calcule a média desta mesma coluna

In [4]:
media = titanic["Age"].mean()
print(media)

29.69911764705882

5- Escolha um critério para eliminar as linhas que possuam valores muito distantes da média e crie um novo Dataframe.

In [5]:
for i, el in enumerate(titanic["Age"]):
  if  abs(el - media) > 5:
     titanic.drop([i],inplace=True)
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 378 entries, 2 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  378 non-null    int64
 1   Pclass       378 non-null    int64
 2   Name         378 non-null    object
 3   Sex          378 non-null    object
 4   Age          201 non-null    float64
 5   SibSp        378 non-null    int64
 6   Parch        378 non-null    int64
 7   Ticket       378 non-null    object
 8   Fare         378 non-null    float64
 9   Cabin        55 non-null     object
 10  Embarked     378 non-null    object
 11  Survived     378 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 38.4+ KB

6- Crie um novo Dataframe que contenha apenas 5 colunas do conjunto anterior.

In [20]:
new_titanic = titanic.iloc[:,:5]
new_titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 378 entries, 2 to 890
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  378 non-null    int64
 1   Pclass       378 non-null    int64
 2   Name         378 non-null    object
 3   Sex          378 non-null    object
 4   Age          201 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 25.8+ KB

7- Escolha duas colunas numéricas e crie uma nova coluna que siga a regra: (Coluna A - Coluna B)*número aleatório (entre 0 e 1).

In [21]:
new_titanic.insert(1,"nova_coluna",((new_titanic["PassengerId"]-new_titanic["Pclass"])*random()))

8- Embaralhe aleatoriamente o dataframe (índices e valores).

In [22]:
new_titanic.reindex(np.random.permutation(new_titanic.index))

,PassengerId,nova_coluna,Pclass,Name,Sex,Age
519,520,220.883993,3,"Pavlovic, Mr. Stefo",male,32.0
564,565,240.109873,3,"Meanwell, Miss. (Marion Ogden)",female,NaN
703,704,299.496478,3,"Gallagher, Mr. Martin",male,25.0
470,471,199.949147,3,"Keefe, Mr. Arthur",male,NaN
573,574,243.955049,3,"Kelly, Miss. Mary",female,NaN
...,...,...,...,...,...,...
639,640,272.153005,3,"Thorneycroft, Mr. Percival",male,NaN
64,65,27.343473,1,"Stewart, Mr. Albert A",male,NaN
420,421,178.587058,3,"Gheorgheff, Mr. Stanio",male,NaN
368,369,156.370487,3,"Jermyn, Miss. Annie",female,NaN
246,247,104.246991,3,"Lindahl, Miss. Agda Thorilda Viktoria",female,25.0

9- Ordene o Dataframe seguindo um critério definido por você (Explique o critério)

In [23]:
new_titanic = new_titanic.sort_values(by="PassengerId",ascending=True) 
display(new_titanic)
# Criterio: ordena os itens da coluna "PassengerId" por ordem crescente

,PassengerId,nova_coluna,Pclass,Name,Sex,Age
2,3,0.000000,3,"Heikkinen, Miss. Laina",female,26.0
5,6,1.281725,3,"Moran, Mr. James",male,NaN
8,9,2.563451,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
17,18,6.835868,2,"Williams, Mr. Charles Eugene",male,NaN
18,19,6.835868,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0
...,...,...,...,...,...,...
884,885,376.827238,3,"Sutehall, Mr. Henry Jr",male,25.0
886,887,378.108963,2,"Montvila, Rev. Juozas",male,27.0
888,889,378.536205,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,379.817930,1,"Behr, Mr. Karl Howell",male,26.0
890,891,379.390689,3,"Dooley, Mr. Patrick",male,32.0

10- Escolha uma coluna numérica e um coluna com strings e utilize a função Groupby para mostrar os totais da  coluna.

In [24]:
num_colunas = new_titanic.groupby("Age")[["Name"]].count()  
print(num_colunas)

      Name
Age
25.0    23
26.0    18
27.0    18
28.0    25
28.5     2
29.0    20
30.0    25
30.5     2
31.0    17
32.0    18
32.5     2
33.0    15
34.0    15
34.5     1

11- Utilize a função MAPS para fazer algum tipo de substituição no Dataframe (explique)

In [25]:
new_titanic["Age"] = new_titanic["Age"].map(lambda n: n*2) 
# coluna "Age" foi teve seus valores multiplicados por 2

12- Exporte o último Dataframe para um arquivo CSV e salve no seu drive

In [26]:
new_titanic.to_csv("/drive/MyDrive/new_titanic.csv")

13- Exporte o último Dataframe para um arquivo CSV e salve no seu drive

In [27]:
json = new_titanic.to_json(orient='table')
with  open('/drive/MyDrive/new_titanic.json', 'w') as file:
  file.write(json)